In [2]:
import numpy as np
import pandas as pd

# Handling Categorical Data

In [3]:
df = pd.DataFrame({
    "Color" : ["Red" , "Blue" , "Black" , "Pink" , "Red" , "Yellow" ]
})

In [4]:
df

    Color
0     Red
1    Blue
2   Black
3    Pink
4     Red
5  Yellow

In [5]:
df.dtypes

Color    object
dtype: object

In [6]:
df["Color"] = df["Color"].astype("category")

In [7]:
df.dtypes

Color    category
dtype: object

In [8]:
sizes = pd.Categorical(['S' , 'M' , 'L' , 'S' , 'L' , 'S' , 'M' , 'L' , 'M'] , categories = ['S' , 'M' , 'L'] , ordered = True)

In [9]:
sizes

['S', 'M', 'L', 'S', 'L', 'S', 'M', 'L', 'M']
Categories (3, object): ['S' < 'M' < 'L']

In [10]:
df_grades = pd.DataFrame({'Grades' : ['A' , 'B' , 'C' , 'A' , 'A' ,'B' , 'C']})

In [17]:
df_grades.value_counts

<bound method DataFrame.value_counts of   Grades
0      A
1      B
2      C
3      A
4      A
5      B
6      C>

In [13]:
df_grades["Grades"] = df_grades["Grades"].astype("category")

In [14]:
df_grades.dtypes

Grades    category
dtype: object

In [18]:
df_grades.value_counts()

Grades
A         3
B         2
C         2
Name: count, dtype: int64

In [19]:
df = pd.DataFrame({
   'Size' : ['M' , 'S' , 'L' , 'M'] ,
   'Iteam' : ['shirt' , 'pants' , 'shirt' , 'cap']
    
})

In [20]:
df

  Size  Iteam
0    M  shirt
1    S  pants
2    L  shirt
3    M    cap

In [22]:
df['Size'] = pd.Categorical(df['Size'] , categories = ['S' , 'M' , 'L'] , ordered = True )

In [23]:
df

  Size  Iteam
0    M  shirt
1    S  pants
2    L  shirt
3    M    cap

In [24]:
df.sort_values(by = 'Size')

  Size  Iteam
1    S  pants
0    M  shirt
3    M    cap
2    L  shirt

In [25]:
df

  Size  Iteam
0    M  shirt
1    S  pants
2    L  shirt
3    M    cap

In [26]:
df['Size'] > 'M'

0    False
1    False
2     True
3    False
Name: Size, dtype: bool

In [27]:
df[df['Size'] > 'M']

  Size  Iteam
2    L  shirt

In [28]:
df[df['Size'] > 'S']

  Size  Iteam
0    M  shirt
2    L  shirt
3    M    cap

In [29]:
df[df['Size'] > 'L']

Empty DataFrame
Columns: [Size, Iteam]
Index: []

In [32]:
df["is_large"] = df['Size'] > 'M'

In [33]:
df

  Size  Iteam  is_large
0    M  shirt     False
1    S  pants     False
2    L  shirt      True
3    M    cap     False

In [34]:
df[df['Size'] == 'S']

  Size  Iteam  is_large
1    S  pants     False

In [35]:
df

  Size  Iteam  is_large
0    M  shirt     False
1    S  pants     False
2    L  shirt      True
3    M    cap     False

#### Rename cetegories

In [37]:
ndf = df['Size'].cat.rename_categories({'S' : 'small' , 'L' : 'large' , 'M' : 'Medium'} )

In [38]:
ndf

0    Medium
1     small
2     large
3    Medium
Name: Size, dtype: category
Categories (3, object): ['small' < 'Medium' < 'large']

In [ ]:
import pandas as pd

# Create a DataFrame
employee = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Hannah', 'Ivy', 'Jack'],
    'Gender': ['Female', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male', 'Female', 'Male'],
    'Age': [25, 30, 22, 28, 35, 40, 21, 29, 33, 26],
    'Salary': [50000, 60000, 45000, 55000, 70000, 80000, 40000, 65000, 75000, 50000],
    'Role': ['Analyst', 'Engineer', 'Analyst', 'Engineer', 'Manager', 'Director', 'Analyst', 'Engineer', 'Manager', 'Director']
})

# Display the DataFrame
print(employee)

      Name  Gender  Age  Salary      Role
0    Alice  Female   25   50000   Analyst
1      Bob    Male   30   60000  Engineer
2  Charlie  Female   22   45000   Analyst
3    David    Male   28   55000  Engineer
4      Eve  Female   35   70000   Manager
5    Frank    Male   40   80000  Director
6    Grace  Female   21   40000   Analyst
7   Hannah    Male   29   65000  Engineer
8      Ivy  Female   33   75000   Manager
9     Jack    Male   26   50000  Director

In [ ]:
pd.get_dummies(employee , columns = ["Gender"])

      Name  Age  Salary      Role  Gender_Female  Gender_Male
0    Alice   25   50000   Analyst           True        False
1      Bob   30   60000  Engineer          False         True
2  Charlie   22   45000   Analyst           True        False
3    David   28   55000  Engineer          False         True
4      Eve   35   70000   Manager           True        False
5    Frank   40   80000  Director          False         True
6    Grace   21   40000   Analyst           True        False
7   Hannah   29   65000  Engineer          False         True
8      Ivy   33   75000   Manager           True        False
9     Jack   26   50000  Director          False         True